app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "meowwwww"], ["created_at", "2014-05-19 15:21:46.647971"], ["post_id", 2], ["updated_at", "2014-05-19 15:21:46.647971"], ["user_id", 1]]
---
  def create
    @comment = Comment.new(comment_params)
    respond_to do |format|
      if @comment.save