app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "meow meow "], ["created_at", "2014-05-19 15:20:20.993823"], ["name", "moar"], ["updated_at", "2014-05-19 15:20:20.993823"], ["user_id", 1]]